{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "name": "image_Inputs"}, "name": "image_Inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 1], "dtype": "float32", "sparse": false, "name": "audio_Inputs"}, "name": "audio_Inputs", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d", "inbound_nodes": [[["image_Inputs", 0, 0, {}]]]}, {"class_name": "ZeroPadding1D", "config": {"name": "zero_padding1d", "trainable": true, "dtype": "float32", "padding": [3, 3]}, "name": "zero_padding1d", "inbound_nodes": [[["audio_Inputs", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_1", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_1", "inbound_nodes": [[["zero_padding1d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_1", "inbound_nodes": [[["Conv2D_Stage_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_1", "inbound_nodes": [[["Conv1D_Stage_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu", "op": "Relu", "input": ["BN2D_Stage_1/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu", "inbound_nodes": [[["BN2D_Stage_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_40", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_40", "op": "Relu", "input": ["BN1D_Stage_1/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_40", "inbound_nodes": [[["BN1D_Stage_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["tf_op_layer_Relu", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d", "inbound_nodes": [[["tf_op_layer_Relu_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_A_a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_A_a", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_A_a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_A_a", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_A_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_A_a", "inbound_nodes": [[["Conv2D_Stage_2_Block_A_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_A_a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_A_a", "inbound_nodes": [[["Conv1D_Stage_2_Block_A_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_1", "op": "Relu", "input": ["BN2D_Stage_2_Block_A_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_1", "inbound_nodes": [[["BN2D_Stage_2_Block_A_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_41", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_41", "op": "Relu", "input": ["BN1D_Stage_2_Block_A_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_41", "inbound_nodes": [[["BN1D_Stage_2_Block_A_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_A_b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_A_b", "inbound_nodes": [[["tf_op_layer_Relu_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_A_b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_A_b", "inbound_nodes": [[["tf_op_layer_Relu_41", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_A_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_A_b", "inbound_nodes": [[["Conv2D_Stage_2_Block_A_b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_A_b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_A_b", "inbound_nodes": [[["Conv1D_Stage_2_Block_A_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_2", "op": "Relu", "input": ["BN2D_Stage_2_Block_A_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_2", "inbound_nodes": [[["BN2D_Stage_2_Block_A_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_42", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_42", "op": "Relu", "input": ["BN1D_Stage_2_Block_A_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_42", "inbound_nodes": [[["BN1D_Stage_2_Block_A_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_A_c", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_A_c", "inbound_nodes": [[["tf_op_layer_Relu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_A_shortcut", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_A_shortcut", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_A_c", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_A_c", "inbound_nodes": [[["tf_op_layer_Relu_42", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_A_shortcut", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_A_shortcut", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_A_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_A_c", "inbound_nodes": [[["Conv2D_Stage_2_Block_A_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_A_shortcut", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_A_shortcut", "inbound_nodes": [[["Conv2D_Stage_2_Block_A_shortcut", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_A_c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_A_c", "inbound_nodes": [[["Conv1D_Stage_2_Block_A_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_A_shortcut", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_A_shortcut", "inbound_nodes": [[["Conv1D_Stage_2_Block_A_shortcut", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["BN2D_Stage_2_Block_A_c", 0, 0, {}], ["BN2D_Stage_2_Block_A_shortcut", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "name": "add_13", "inbound_nodes": [[["BN1D_Stage_2_Block_A_c", 0, 0, {}], ["BN1D_Stage_2_Block_A_shortcut", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_3", "op": "Relu", "input": ["add/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_3", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_43", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_43", "op": "Relu", "input": ["add_13/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_43", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_B_a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_B_a", "inbound_nodes": [[["tf_op_layer_Relu_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_B_a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_B_a", "inbound_nodes": [[["tf_op_layer_Relu_43", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_B_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_B_a", "inbound_nodes": [[["Conv2D_Stage_2_Block_B_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_B_a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_B_a", "inbound_nodes": [[["Conv1D_Stage_2_Block_B_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_4", "op": "Relu", "input": ["BN2D_Stage_2_Block_B_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_4", "inbound_nodes": [[["BN2D_Stage_2_Block_B_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_44", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_44", "op": "Relu", "input": ["BN1D_Stage_2_Block_B_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_44", "inbound_nodes": [[["BN1D_Stage_2_Block_B_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_B_b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_B_b", "inbound_nodes": [[["tf_op_layer_Relu_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_B_b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_B_b", "inbound_nodes": [[["tf_op_layer_Relu_44", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_B_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_B_b", "inbound_nodes": [[["Conv2D_Stage_2_Block_B_b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_B_b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_B_b", "inbound_nodes": [[["Conv1D_Stage_2_Block_B_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_5", "op": "Relu", "input": ["BN2D_Stage_2_Block_B_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_5", "inbound_nodes": [[["BN2D_Stage_2_Block_B_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_45", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_45", "op": "Relu", "input": ["BN1D_Stage_2_Block_B_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_45", "inbound_nodes": [[["BN1D_Stage_2_Block_B_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_B_c", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_B_c", "inbound_nodes": [[["tf_op_layer_Relu_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_B_c", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_B_c", "inbound_nodes": [[["tf_op_layer_Relu_45", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_B_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_B_c", "inbound_nodes": [[["Conv2D_Stage_2_Block_B_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_B_c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_B_c", "inbound_nodes": [[["Conv1D_Stage_2_Block_B_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["BN2D_Stage_2_Block_B_c", 0, 0, {}], ["tf_op_layer_Relu_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "name": "add_14", "inbound_nodes": [[["BN1D_Stage_2_Block_B_c", 0, 0, {}], ["tf_op_layer_Relu_43", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_6", "op": "Relu", "input": ["add_1/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_6", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_46", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_46", "op": "Relu", "input": ["add_14/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_46", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_C_a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_C_a", "inbound_nodes": [[["tf_op_layer_Relu_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_C_a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_C_a", "inbound_nodes": [[["tf_op_layer_Relu_46", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_C_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_C_a", "inbound_nodes": [[["Conv2D_Stage_2_Block_C_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_C_a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_C_a", "inbound_nodes": [[["Conv1D_Stage_2_Block_C_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_7", "op": "Relu", "input": ["BN2D_Stage_2_Block_C_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_7", "inbound_nodes": [[["BN2D_Stage_2_Block_C_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_47", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_47", "op": "Relu", "input": ["BN1D_Stage_2_Block_C_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_47", "inbound_nodes": [[["BN1D_Stage_2_Block_C_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_C_b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_C_b", "inbound_nodes": [[["tf_op_layer_Relu_7", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_C_b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_C_b", "inbound_nodes": [[["tf_op_layer_Relu_47", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_C_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_C_b", "inbound_nodes": [[["Conv2D_Stage_2_Block_C_b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_C_b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_C_b", "inbound_nodes": [[["Conv1D_Stage_2_Block_C_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_8", "op": "Relu", "input": ["BN2D_Stage_2_Block_C_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_8", "inbound_nodes": [[["BN2D_Stage_2_Block_C_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_48", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_48", "op": "Relu", "input": ["BN1D_Stage_2_Block_C_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_48", "inbound_nodes": [[["BN1D_Stage_2_Block_C_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_2_Block_C_c", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_2_Block_C_c", "inbound_nodes": [[["tf_op_layer_Relu_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_2_Block_C_c", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_2_Block_C_c", "inbound_nodes": [[["tf_op_layer_Relu_48", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_2_Block_C_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_2_Block_C_c", "inbound_nodes": [[["Conv2D_Stage_2_Block_C_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_2_Block_C_c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_2_Block_C_c", "inbound_nodes": [[["Conv1D_Stage_2_Block_C_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["BN2D_Stage_2_Block_C_c", 0, 0, {}], ["tf_op_layer_Relu_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_15", "trainable": true, "dtype": "float32"}, "name": "add_15", "inbound_nodes": [[["BN1D_Stage_2_Block_C_c", 0, 0, {}], ["tf_op_layer_Relu_46", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_9", "op": "Relu", "input": ["add_2/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_9", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_49", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_49", "op": "Relu", "input": ["add_15/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_49", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_3_Block_A_a", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_3_Block_A_a", "inbound_nodes": [[["tf_op_layer_Relu_9", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_3_Block_A_a", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_3_Block_A_a", "inbound_nodes": [[["tf_op_layer_Relu_49", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_3_Block_A_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_3_Block_A_a", "inbound_nodes": [[["Conv2D_Stage_3_Block_A_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_3_Block_A_a", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_3_Block_A_a", "inbound_nodes": [[["Conv1D_Stage_3_Block_A_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_10", "op": "Relu", "input": ["BN2D_Stage_3_Block_A_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_10", "inbound_nodes": [[["BN2D_Stage_3_Block_A_a", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_50", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_50", "op": "Relu", "input": ["BN1D_Stage_3_Block_A_a/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_50", "inbound_nodes": [[["BN1D_Stage_3_Block_A_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_3_Block_A_b", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_3_Block_A_b", "inbound_nodes": [[["tf_op_layer_Relu_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_3_Block_A_b", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_3_Block_A_b", "inbound_nodes": [[["tf_op_layer_Relu_50", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_3_Block_A_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_3_Block_A_b", "inbound_nodes": [[["Conv2D_Stage_3_Block_A_b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_3_Block_A_b", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_3_Block_A_b", "inbound_nodes": [[["Conv1D_Stage_3_Block_A_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_11", "op": "Relu", "input": ["BN2D_Stage_3_Block_A_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_11", "inbound_nodes": [[["BN2D_Stage_3_Block_A_b", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_51", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_51", "op": "Relu", "input": ["BN1D_Stage_3_Block_A_b/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_51", "inbound_nodes": [[["BN1D_Stage_3_Block_A_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_3_Block_A_c", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_3_Block_A_c", "inbound_nodes": [[["tf_op_layer_Relu_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_Stage_3_Block_A_shortcut", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_Stage_3_Block_A_shortcut", "inbound_nodes": [[["tf_op_layer_Relu_9", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_3_Block_A_c", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_3_Block_A_c", "inbound_nodes": [[["tf_op_layer_Relu_51", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Stage_3_Block_A_shortcut", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Stage_3_Block_A_shortcut", "inbound_nodes": [[["tf_op_layer_Relu_49", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_3_Block_A_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_3_Block_A_c", "inbound_nodes": [[["Conv2D_Stage_3_Block_A_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN2D_Stage_3_Block_A_shortcut", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN2D_Stage_3_Block_A_shortcut", "inbound_nodes": [[["Conv2D_Stage_3_Block_A_shortcut", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_3_Block_A_c", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_3_Block_A_c", "inbound_nodes": [[["Conv1D_Stage_3_Block_A_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN1D_Stage_3_Block_A_shortcut", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN1D_Stage_3_Block_A_shortcut", "inbound_nodes": [[["Conv1D_Stage_3_Block_A_shortcut", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": 